[
    {"name": "Dagger +1", "rarity": "uncommon", "type": "weapon", "description": "You have a +1 bonus to attack and damage rolls made with this magic weapon. Proficiency with a dagger allows you to add your proficiency bonus to the attack roll for any attack you make with it."},
    {"name": "Longsword +1", "rarity": "uncommon", "type": "weapon", "description": "You have a +1 bonus to attack and damage rolls made with this magic weapon. Proficiency with a longsword allows you to add your proficiency bonus to the attack roll for any attack you make with it."},
    {"name": "Longbow +1", "rarity": "uncommon", "type": "weapon", "description": "You have a +1 bonus to attack and damage rolls made with this magic weapon. Proficiency with a longbow allows you to add your proficiency bonus to the attack roll for any attack you make with it."},
    {"name": "Armblade", "rarity": "common", "type": "weapon", "description": "An armblade is a magic weapon that attaches to your arm, becoming inseparable from you as long as you're attuned to it. To attune to this item, you must hold it against your forearm for the entire attunement period. As a bonus action, you can retract the armblade into your forearm or extend it from there. While it is extended, you can use the weapon as if you were holding it, and you can't use that hand for other purposes."},
    {"name": "Staff of Flowers", "rarity": "common", "type": "staff", "description": "This wooden staff has 10 charges. While holding it, you can use an action to expend 1 charge from the staff and cause a flower to sprout from a patch of earth or soil within 5 feet of you, or from the staff itself. Unless you choose a specific kind of flower, the staff creates a mild-scented daisy. The flower is harmless and nonmagical, and it grows or withers as a normal flower would. The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff turns into flower petals and is lost forever."},
    {"name": "Ring of Exorcism", "rarity": "rare", "type": "wondrous item", "description": "This ring allows the wearer to"}
]